RIET/src/DataProcessors/ргВыгрузкаВоВнешниеИБ/ргВыгрузкаВоВнешниеИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ргВыгрузкаВоВнешниеИБ</name>
  <tabularSections>
    <name>СписокБаз</name>
    <attributes>
      <name>База</name>
      <type>
        <types>ExchangePlanRef.ргОбменСВнешнимиИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/DataProcessors/ргВыгрузкаВоВнешниеИБ/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменСВнешнимиИБ.Ссылка КАК База,
	|	ИСТИНА КАК Выгружать
	|ИЗ
	|	ПланОбмена.ргОбменСВнешнимиИБ КАК ОбменСВнешнимиИБ
	|ГДЕ
	|	НЕ ОбменСВнешнимиИБ.ПометкаУдаления
	|	И ОбменСВнешнимиИБ.Активен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбменСВнешнимиИБ.Код";
	
	Объект.СписокБаз.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьВсеФлажки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.СписокБаз Цикл
		СтрокаТЧ.Выгружать = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	Для Каждого СтрокаТЧ Из Объект.СписокБаз Цикл
		СтрокаТЧ.Выгружать = Ложь;
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	ВыполнитьВыгрузкуСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуСервер()
	
	РеквизитФормыВЗначение("Объект").ВыполнитьВыгрузку();
	
КонецПроцедуры
